#include "Key.h"
extern SPK;

extern l_keydat;

code unsigned char key_tab[17]={0xee,0xde,0xbe,0x7e,
								0xed,0xdd,0xbd,0x7d,
								0xeb,0xdb,0xbb,0x7b,
								0xe7,0xd7,0xb7,0x77,0XFF};
/***********扫描键盘 获取键值********************************************************/
//这个子函数有一个不好的地方，就是在键盘上连续按两次相同的键，第二次的就被屏蔽了——pxh
void ReadKey(void)				//分三个部份来理解，
{
	unsigned char i,j,lkey;
									
	//**************第一部份，扫描读取键值******************************/
	j=0xfe;
	lkey=0xff;					//设定初值
	for (i=0;i<4;i++)
	{		
		P1=j;					//P0口低4位循环输出0，扫描键盘
		if ((P1&0xf0)!=0xf0)
		{	//如果有键按下，P0口高4位不会全等于1，即十六进制F，									
			lkey=P1;				//读取P0口，退出循环，否则循环下次
			break;		
		}
		j=_crol_(j,1);			//此函数功能为左循环移位
	}

	/****************第二部份，检测是否干扰或无按键按下********************/
	if (lkey==0xff)
	{				//如果读取不到P0口的值，比如是干扰或是键盘已松开，我们做相应复位，返回
		SPK=1;					//按键有松开,停止蜂鸣器响
		return;
	}
	else
		SPK=0;					//否则打开蜂鸣器，继续处理

	/****************第三部份，检测是否新按键按下，获取新的键盘编码值*******/		
		for(i=0;i<16;i++)
		{		//查表获得相应的16进制值存放l_key变量中
			if (lkey==key_tab[i])
			{
				l_keydat=i;
				break;
			}
		}
	}
	//转换回的键值放于l_key变量中，主程序就可以检测此变量做相应外理
